In [12]:

import pandas as pd
df=pd.read_csv(r"C:\Tekworks\Day 6\Dataset_1.csv")
df

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered
0,ORD1000,NaN,NaN,250.5,2023-01-15,Debit Card,NaN,5,True
1,ORD1001,NaN,18.0,1200,2023/03/10,Debit Card,NaN,5,yes
2,ORD1002,CUST2,35.0,NaN,NaN,NaN,Mumbai,7,yes
3,ORD1003,user_3,35.0,1200,2023-01-15,Cash,NaN,three,False
4,ORD1004,user_4,-3.0,3500.75,2023-01-15,CARD,NaN,three,yes
...,...,...,...,...,...,...,...,...,...
995,NaN,user_995,-3.0,3500.75,15/02/2023,upi,Mumbai,1,True
996,NaN,CUST996,18.0,NaN,2023-01-15,Credit Card,Hyderabad,2,yes
997,NaN,user_997,50.0,NaN,2023/03/10,Cash,Delhi,1,NaN
998,ORD1998,NaN,65.0,1200,2023-01-15,NaN,Mumbai,2,False
999,NaN,user_999,120.0,NaN,15/02/2023,Debit Card,NaN,-1,True

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   order_id       358 non-null    object
 1   customer_id    489 non-null    object
 2   customer_age   749 non-null    float64
 3   order_amount   723 non-null    object
 4   order_date     805 non-null    object
 5   payment_mode   865 non-null    object
 6   city           858 non-null    object
 7   delivery_days  849 non-null    object
 8   is_delivered   814 non-null    object
dtypes: float64(1), object(8)
memory usage: 70.4+ KB

In [17]:
df.columns

Index(['order_id', 'customer_id', 'customer_age', 'order_amount', 'order_date',
       'payment_mode', 'city', 'delivery_days', 'is_delivered'],
      dtype='object')

In [11]:
df.dtypes

order_id          object
customer_id       object
customer_age     float64
order_amount      object
order_date        object
payment_mode      object
city              object
delivery_days     object
is_delivered      object
dtype: object

In [13]:
df.shape

(1000, 9)

In [15]:
#1.Identify all rows where order_amount is non-numeric but is_delivered is marked as deliverd
invalid_rows = df[
    (pd.to_numeric(df['order_amount'], errors='coerce').isnull()) &
    (df['is_delivered'].str.lower() == 'deliverd')
]

print(invalid_rows)

Empty DataFrame
Columns: [order_id, customer_id, customer_age, order_amount, order_date, payment_mode, city, delivery_days, is_delivered]
Index: []

In [16]:
invalid_rows.shape[0]

0

In [23]:
mask = pd.to_numeric(df["order_amount"], errors="coerce").isna() & \
df["is_delivered"].astype(str).str.lower().isin(["true","yes"])
mask

0      False
1      False
2       True
3      False
4      False
       ...
995    False
996     True
997    False
998    False
999     True
Length: 1000, dtype: bool

In [42]:
#2.Covert order_date to datetime and find orderd where delivery_days is negative after valid date conversion
# notna() display the valid date
df[
    pd.to_datetime(df["order_date"], errors="coerce").notna() &
    (pd.to_numeric(df["delivery_days"], errors="coerce") < 0)
]

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered
99,NaN,NaN,50.0,250.5,2023-01-15,Debit Card,Hyderabad,-1,NaN
115,ORD1115,NaN,-3.0,250.5,2023-01-15,Cash,mumbai,-1,False
143,NaN,user_143,25.0,3500.75,2023-01-15,Debit Card,Hyderabad,-1,NaN
155,NaN,CUST155,NaN,499.99,2023-01-15,upi,Delhi,-1,yes
170,NaN,NaN,NaN,1200,2023-01-15,Cash,DELHI,-1,True
238,ORD1238,user_238,NaN,NaN,2023-01-15,CARD,DELHI,-1,False
270,NaN,NaN,35.0,₹999,2023-01-15,CARD,Delhi,-1,False
272,NaN,user_272,65.0,NaN,2023-01-15,UPI,NaN,-1,NaN
303,ORD1303,user_303,35.0,250.5,2023-01-15,Cash,Hyderabad,-1,False
334,NaN,user_334,50.0,499.99,2023-01-15,upi,Delhi,-1,no
407,NaN,NaN,65.0,1200,2023-01-15,CARD,DELHI,-1,True
429,NaN,user_429,35.0,₹999,2023-01-15,CARD,NaN,-1,NaN
493,NaN,NaN,-3.0,1200,2023-01-15,CARD,Hyderabad,-1,no
561,NaN,user_561,25.0,3500.75,2023-01-15,upi,DELHI,-1,yes
628,NaN,NaN,50.0,₹999,2023-01-15,upi,Delhi,-1,no
639,NaN,CUST639,-3.0,499.99,2023-01-15,Cash,DELHI,-1,no
674,NaN,NaN,18.0,₹999,2023-01-15,upi,mumbai,-1,True
720,ORD1720,NaN,35.0,1200,2023-01-15,upi,NaN,-1,False
726,NaN,NaN,NaN,499.99,2023-01-15,upi,Hyderabad,-1,no
741,ORD1741,CUST741,50.0,250.5,2023-01-15,UPI,Mumbai,-1,yes
751,ORD1751,NaN,35.0,NaN,2023-01-15,Cash,Delhi,-1,True
763,NaN,NaN,NaN,250.5,2023-01-15,Debit Card,DELHI,-1,NaN
780,ORD1780,NaN,25.0,NaN,2023-01-15,upi,Hyderabad,-1,yes
838,NaN,user_838,NaN,3500.75,2023-01-15,NaN,Mumbai,-1,no
880,ORD1880,user_880,35.0,1200,2023-01-15,Cash,Mumbai,-1,True
934,NaN,NaN,-3.0,NaN,2023-01-15,UPI,mumbai,-1,no
937,ORD1937,CUST937,-3.0,NaN,2023-01-15,Debit Card,mumbai,-1,yes
945,ORD1945,NaN,NaN,250.5,2023-01-15,NaN,mumbai,-1,no

In [46]:
df['order_date']= pd.to_datetime(df['order_date'],errors='coerce' ,dayfirst=True)
df['delivery_days'] = pd.to_numeric(df['delivery_days'],errors = 'coerce')
df[(df['delivery_days'].notna()) & (df['delivery_days'] < 0)]

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered
9,NaN,user_9,NaN,NaN,NaT,UPI,Delhi,-1.0,no
11,NaN,CUST11,18.0,3500.75,NaT,Cash,Mumbai,-1.0,False
35,NaN,user_35,50.0,499.99,NaT,Cash,DELHI,-1.0,yes
47,NaN,user_47,25.0,NaN,NaT,Cash,Mumbai,-1.0,NaN
49,ORD1049,CUST49,120.0,3500.75,NaT,NaN,Hyderabad,-1.0,False
...,...,...,...,...,...,...,...,...,...
936,ORD1936,user_936,NaN,NaN,NaT,UPI,Bangalore,-1.0,no
937,ORD1937,CUST937,-3.0,NaN,2023-01-15,Debit Card,mumbai,-1.0,yes
938,ORD1938,user_938,65.0,250.5,NaT,upi,mumbai,-1.0,NaN
945,ORD1945,NaN,NaN,250.5,2023-01-15,NaN,mumbai,-1.0,no
999,NaN,user_999,120.0,NaN,NaT,Debit Card,NaN,-1.0,True

In [47]:
df['order_date'].notna().value_counts()

order_date
False    796
True     204
Name: count, dtype: int64

In [48]:
#3. Standardize payment_mode and calculate the percentage share of each mode per city
import pandas as pd

df['payment_mode'] = (
    df['payment_mode']
    .str.strip()
    .str.lower()
)

In [49]:
counts = (
    df.groupby(['city', 'payment_mode'])
      .size()
      .reset_index(name='count')
)

In [50]:
counts['percentage_share'] = (
    counts['count'] /
    counts.groupby('city')['count'].transform('sum')
) * 100

In [51]:
counts.sort_values(['city', 'percentage_share'], ascending=[True, False])

         city payment_mode  count  percentage_share
4   Bangalore          upi     42         32.812500
0   Bangalore         card     25         19.531250
3   Bangalore   debit card     24         18.750000
1   Bangalore         cash     22         17.187500
2   Bangalore  credit card     15         11.718750
9       DELHI          upi     39         30.708661
8       DELHI   debit card     25         19.685039
6       DELHI         cash     23         18.110236
7       DELHI  credit card     21         16.535433
5       DELHI         card     19         14.960630
14      Delhi          upi     50         34.246575
10      Delhi         card     29         19.863014
13      Delhi   debit card     24         16.438356
11      Delhi         cash     23         15.753425
12      Delhi  credit card     20         13.698630
19  Hyderabad          upi     36         30.769231
15  Hyderabad         card     23         19.658120
16  Hyderabad         cash     20         17.094017
18  Hyderabad   debit card     20         17.094017
17  Hyderabad  credit card     18         15.384615
24     Mumbai          upi     44         36.363636
21     Mumbai         cash     25         20.661157
23     Mumbai   debit card     24         19.834711
22     Mumbai  credit card     15         12.396694
20     Mumbai         card     13         10.743802
29     mumbai          upi     37         35.922330
26     mumbai         cash     19         18.446602
25     mumbai         card     18         17.475728
27     mumbai  credit card     17         16.504854
28     mumbai   debit card     12         11.650485

In [43]:
#4.Detect customers whose customer_age is invalid but have order amounts above the dataset median
import pandas as pd
df=pd.read_csv(r"C:\Tekworks\Day 6\Dataset_1.csv")
df['order_amount'] = pd.to_numeric(df['order_amount'], errors='coerce')
df['order_amount']

0       250.50
1      1200.00
2          NaN
3      1200.00
4      3500.75
        ...
995    3500.75
996        NaN
997        NaN
998    1200.00
999        NaN
Name: order_amount, Length: 1000, dtype: float64

In [44]:
median_order_amount = df['order_amount'].median()
median_order_amount

499.99

In [46]:
invalid_age_condition = (
    df['customer_age'].isna() |
    (df['customer_age'] <= 0) |
    (df['customer_age'] > 120)
)
invalid_age_condition

0       True
1      False
2      False
3      False
4       True
       ...
995     True
996    False
997    False
998    False
999    False
Name: customer_age, Length: 1000, dtype: bool

In [47]:
suspicious_customers = df[
    invalid_age_condition &
    (df['order_amount'] > median_order_amount)
]
print(suspicious_customers)

    order_id customer_id  customer_age  order_amount  order_date payment_mode  \
4    ORD1004      user_4          -3.0       3500.75  2023-01-15         CARD
5        NaN         NaN           NaN       1200.00  2023-01-15         CARD
37       NaN         NaN           NaN       3500.75  15/02/2023         CARD
44   ORD1044         NaN           NaN       3500.75  15/02/2023          upi
59       NaN         NaN          -3.0       3500.75  15/02/2023         Cash
..       ...         ...           ...           ...         ...          ...
950      NaN         NaN          -3.0       1200.00  2023/03/10         Cash
951      NaN    user_951          -3.0       3500.75  2023-01-15  Credit Card
989  ORD1989         NaN           NaN       1200.00  2023-01-15          UPI
991      NaN         NaN          -3.0       3500.75  2023/03/10         CARD
995      NaN    user_995          -3.0       3500.75  15/02/2023          upi

          city delivery_days is_delivered
4          NaN         three          yes
5       mumbai             1        False
37      mumbai             7          NaN
44      mumbai         three          yes
59   Bangalore         three        False
..         ...           ...          ...
950  Bangalore             2           no
951  Hyderabad             5          yes
989     Mumbai         three           no
991  Hyderabad             1          yes
995     Mumbai             1         True

[107 rows x 9 columns]

In [17]:
#5.Find duplicate customer_ids where the same customer placed orders in multiple cities
duplicate_customers = (
    df.groupby('customer_id')['city']
      .nunique()
      .reset_index(name='city_count')
)

result = duplicate_customers[duplicate_customers['city_count'] > 1]

print(result)

Empty DataFrame
Columns: [customer_id, city_count]
Index: []

In [18]:
multi_city_orders = df[
    df['customer_id'].isin(result['customer_id'])
].sort_values('customer_id')

print(multi_city_orders)

Empty DataFrame
Columns: [order_id, customer_id, customer_age, order_amount, order_date, payment_mode, city, delivery_days, is_delivered]
Index: []

In [20]:
result.shape[0]

0

In [48]:
#6.create a flag for orders where delivery_days is missing but is_delivered is True
df['is_delivered'] =(
    df['is_delivered']
    .astype(str)
    .str.strip()
    .str.lower()
    .map({'true': True, 'yes': True, '1': True, 'false': False, 'no': False, '0': False})
)
df['is_delivered']

0       True
1       True
2       True
3      False
4       True
       ...
995     True
996     True
997      NaN
998    False
999     True
Name: is_delivered, Length: 1000, dtype: object

In [49]:
df['missing_delivery_days_flag'] = (
    df['delivery_days'].isna() &
    (df['is_delivered'] == True)
)
df['missing_delivery_days_flag']

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Name: missing_delivery_days_flag, Length: 1000, dtype: bool

In [28]:
df[df['missing_delivery_days_flag']]

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered,missing_delivery_days_flag
17,NaN,NaN,-3.0,NaN,15/02/2023,upi,Hyderabad,NaN,True,True
21,NaN,NaN,25.0,499.99,NaN,Credit Card,Mumbai,NaN,True,True
27,NaN,NaN,25.0,NaN,2023-01-15,NaN,NaN,NaN,True,True
33,ORD1033,user_33,120.0,499.99,15/02/2023,upi,Bangalore,NaN,True,True
42,NaN,user_42,18.0,NaN,invalid,NaN,Hyderabad,NaN,True,True
...,...,...,...,...,...,...,...,...,...,...
943,NaN,user_943,NaN,NaN,2023/03/10,Credit Card,DELHI,NaN,True,True
967,NaN,NaN,65.0,NaN,invalid,NaN,Mumbai,NaN,True,True
979,NaN,NaN,18.0,1200.00,invalid,NaN,Hyderabad,NaN,True,True
980,NaN,CUST980,NaN,250.50,15/02/2023,Cash,Bangalore,NaN,True,True
987,NaN,CUST987,50.0,NaN,2023/03/10,NaN,Bangalore,NaN,True,True

In [29]:
df['missing_delivery_days_flag'].sum()

np.int64(63)

In [41]:
#7.After cleaning, compute the average order value per payment mode, excluding invalid amounts
import pandas as pd
df['order_amount'] = pd.to_numeric(df['order_amount'], errors='coerce')
# Keep only valid (positive) amounts
clean_df = df[df['order_amount'] > 0]
clean_df

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered,missing_delivery_days_flag
0,ORD1000,NaN,NaN,250.50,2023-01-15,Debit Card,NaN,5,True,False
1,ORD1001,NaN,18.0,1200.00,2023/03/10,Debit Card,NaN,5,True,False
3,ORD1003,user_3,35.0,1200.00,2023-01-15,Cash,NaN,three,False,False
4,ORD1004,user_4,-3.0,3500.75,2023-01-15,CARD,NaN,three,True,False
5,NaN,NaN,NaN,1200.00,2023-01-15,CARD,mumbai,1,False,False
...,...,...,...,...,...,...,...,...,...,...
991,NaN,NaN,-3.0,3500.75,2023/03/10,CARD,Hyderabad,1,True,False
993,NaN,NaN,18.0,3500.75,NaN,NaN,Hyderabad,2,True,False
994,NaN,NaN,NaN,250.50,invalid,Debit Card,Bangalore,three,False,False
995,NaN,user_995,-3.0,3500.75,15/02/2023,upi,Mumbai,1,True,False
998,ORD1998,NaN,65.0,1200.00,2023-01-15,NaN,Mumbai,2,False,False

In [42]:
clean_df['payment_mode'] = (
    clean_df['payment_mode']
    .str.strip()
    .str.lower()
)
clean_df['payment_mode']

C:\Users\MAHIPALREDDY\AppData\Local\Temp\ipykernel_30444\981336278.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  clean_df['payment_mode'] = (

0      debit card
1      debit card
3            cash
4            card
5            card
          ...
991          card
993           NaN
994    debit card
995           upi
998           NaN
Name: payment_mode, Length: 565, dtype: object

In [37]:
avg_order_value = (
    clean_df.groupby('payment_mode')['order_amount']
            .mean()
            .reset_index(name='average_order_value')
)
avg_order_value

  payment_mode  average_order_value
0         card          1553.016237
1         cash          1414.393708
2  credit card          1243.262656
3   debit card          1432.739318
4          upi          1349.349091

In [63]:
#8.Identify cities where more than 30% of orders have missing order_date
city_missing = (df.assign(missing = df['order_date'].isna())

                         .groupby('city')['missing']
                         .mean()
                         .mul(100)
)
city_missing[city_missing > 30]

city
Bangalore    80.794702
DELHI        78.723404
Delhi        81.987578
Hyderabad    84.397163
Mumbai       75.862069
mumbai       72.268908
Name: missing, dtype: float64

In [7]:
import pandas as pd
df=pd.read_csv(r"C:\Tekworks\Day 6\Dataset_1.csv")
df

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered
0,ORD1000,NaN,NaN,250.5,2023-01-15,Debit Card,NaN,5,True
1,ORD1001,NaN,18.0,1200,2023/03/10,Debit Card,NaN,5,yes
2,ORD1002,CUST2,35.0,NaN,NaN,NaN,Mumbai,7,yes
3,ORD1003,user_3,35.0,1200,2023-01-15,Cash,NaN,three,False
4,ORD1004,user_4,-3.0,3500.75,2023-01-15,CARD,NaN,three,yes
...,...,...,...,...,...,...,...,...,...
995,NaN,user_995,-3.0,3500.75,15/02/2023,upi,Mumbai,1,True
996,NaN,CUST996,18.0,NaN,2023-01-15,Credit Card,Hyderabad,2,yes
997,NaN,user_997,50.0,NaN,2023/03/10,Cash,Delhi,1,NaN
998,ORD1998,NaN,65.0,1200,2023-01-15,NaN,Mumbai,2,False
999,NaN,user_999,120.0,NaN,15/02/2023,Debit Card,NaN,-1,True

In [10]:
#10.Normalize city names to a consistent case and spelling.
df['city'] = (
    df['city']
    .astype(str)
    .str.strip()
    .str.title()
)
df['city']

0            Nan
1            Nan
2         Mumbai
3            Nan
4            Nan
         ...
995       Mumbai
996    Hyderabad
997        Delhi
998       Mumbai
999          Nan
Name: city, Length: 1000, dtype: object

In [4]:

import pandas as pd
df=pd.read_csv(r"C:\Tekworks\Day 6\messy_employee_dataset_1000_rows.csv")
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,user_0,-5,₹50000,HR,2020/12/01,DELHI,3,five,True
1,U1001,30,45000,Finance,15/02/2021,Delhi,3,1,yes
2,U1002,30,25000,HR,NaN,Delhi,excellent,10,False
3,NaN,unknown,NaN,HR,invalid,Hyderabad,excellent,5,yes
4,NaN,NaN,120000.75,IT,NaN,DELHI,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60,₹50000,HR,15/02/2021,DELHI,2,five,NaN
996,U1996,NaN,NaN,IT,15/02/2021,Mumbai,NaN,5,no
997,user_997,unknown,25000,HR,invalid,Mumbai,3,5,True
998,U1998,-5,25000,NaN,15/02/2021,Bangalore,1,0,True
999,NaN,30,45000,HR,2022-01-15,Hyderabad,excellent,five,no

In [7]:
#11.Convert performance_score into numeric by mapping text values to numbers
import pandas as pd
# sample mapping
performance_map = {
    "Excellent": 5,
    "Very Good": 4,
    "Good": 3,
    "Average": 2,
    "Poor": 1
}
# standardize text first (recommended)
df['performance_score'] = (
    df['performance_score']
    .str.strip()
    .str.title()
)
# map text to numeric
df['performance_score_numeric'] = df['performance_score'].map(performance_map)

print(df[['performance_score', 'performance_score_numeric']])

    performance_score  performance_score_numeric
0                   3                        NaN
1                   3                        NaN
2           Excellent                        5.0
3           Excellent                        5.0
4                 NaN                        NaN
..                ...                        ...
995                 2                        NaN
996               NaN                        NaN
997                 3                        NaN
998                 1                        NaN
999         Excellent                        5.0

[1000 rows x 2 columns]

In [6]:
df['performance_score_numeric'].dtype

dtype('float64')

In [ ]:

performance_map = {
    'Excellent': 5,
    'Very Good': 4,
    'Good': 3,
    'Average': 2,
    'Poor': 1
}

In [14]:
df['performance_score'] = df['performance_score'].str.strip().str.title()
df['performance_score']
df['performance_score_numeric'] = df['performance_score'].map(performance_map)
df['performance_score_numeric']

0      NaN
1      NaN
2      5.0
3      5.0
4      NaN
      ...
995    NaN
996    NaN
997    NaN
998    NaN
999    5.0
Name: performance_score_numeric, Length: 1000, dtype: float64

In [ ]:
#12.Clean experience_years by converting text values to numeric and removing negatives.
import pandas as pd
import numpy as np
# convert text to numeric (invalid values → NaN)
df['experience_years'] = pd.to_numeric(df['experience_years'], errors='coerce')
# remove negative values
df.loc[df['experience_years'] < 0, 'experience_years'] = np.nan

In [16]:
df['experience_years'].describe()

count    615.000000
mean       3.783740
std        3.472141
min        0.000000
25%        1.000000
50%        3.000000
75%        5.000000
max       10.000000
Name: experience_years, dtype: float64

In [25]:
#13.Convert is_active values (yes/no/True/False) into boolean format. 
df['is_active'] = df['is_active'].astype(str).str.strip().str.lower()
# map to boolean
active_map = {
    'yes': True,
    'true': True,
    '1': True,
    'no': False,
    'false': False,
    '0': False
}
df['is_active'] = df['is_active'].map(active_map)
df['is_active']

0       True
1       True
2      False
3       True
5      False
       ...
990    False
991     True
996    False
997     True
998     True
Name: is_active, Length: 491, dtype: object

In [24]:
#14.Identify and remove duplicate records based on user_id.
df[df.duplicated(subset='user_id', keep=False)]
# remove duplicates (keep first occurrence)
df = df.drop_duplicates(subset='user_id', keep='first')
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,performance_score_numeric
0,user_0,-5,₹50000,HR,2020/12/01,DELHI,3,NaN,True,NaN
1,U1001,30,45000,Finance,15/02/2021,Delhi,3,1.0,True,NaN
2,U1002,30,25000,HR,NaN,Delhi,Excellent,10.0,False,5.0
3,NaN,unknown,NaN,HR,invalid,Hyderabad,Excellent,5.0,True,5.0
5,user_5,NaN,25000,IT,invalid,NaN,3,0.0,False,NaN
...,...,...,...,...,...,...,...,...,...,...
990,U1990,200,NaN,Sales,15/02/2021,Hyderabad,NaN,NaN,False,NaN
991,U1991,45,NaN,HR,NaN,mumbai,NaN,NaN,True,NaN
996,U1996,NaN,NaN,IT,15/02/2021,Mumbai,NaN,5.0,False,NaN
997,user_997,unknown,25000,HR,invalid,Mumbai,3,5.0,True,NaN
998,U1998,-5,25000,NaN,15/02/2021,Bangalore,1,0.0,True,NaN

In [23]:
#15.Create a clean final DataFrame containing only valid, standardized records.
# remove rows with critical missing values
clean_df = df.dropna(subset=[
    'user_id',
    'experience_years',
    'performance_score_numeric',
    'is_active'
])
# reset index
clean_df = clean_df.reset_index(drop=True)
clean_df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,performance_score_numeric
0,U1002,30,25000,HR,NaN,Delhi,Excellent,10.0,False,5.0
1,U1009,200,NaN,IT,NaN,Bangalore,Poor,1.0,False,1.0
2,U1010,45,78000,Sales,NaN,mumbai,Excellent,5.0,False,5.0
3,user_28,unknown,₹50000,it,NaN,DELHI,Poor,3.0,True,1.0
4,user_29,25,25000,HR,2020/12/01,DELHI,Poor,3.0,True,1.0
5,U1037,unknown,25000,it,2020/12/01,Bangalore,Poor,1.0,True,1.0
6,user_64,NaN,78000,HR,NaN,Delhi,Excellent,0.0,True,5.0
7,user_66,45,NaN,it,15/02/2021,mumbai,Excellent,10.0,True,5.0
8,U1073,45,45000,IT,invalid,Hyderabad,Poor,1.0,True,1.0
9,U1079,-5,₹50000,IT,invalid,Mumbai,Excellent,1.0,False,5.0
10,U1098,NaN,78000,IT,invalid,Delhi,Poor,0.0,False,1.0
11,U1107,18,₹50000,it,15/02/2021,Mumbai,Poor,5.0,False,1.0
12,user_174,60,45000,IT,NaN,Mumbai,Poor,10.0,True,1.0
13,user_190,60,NaN,IT,2020/12/01,DELHI,Excellent,0.0,False,5.0
14,user_209,200,NaN,HR,2022-01-15,Delhi,Excellent,0.0,True,5.0
15,U1221,-5,NaN,IT,invalid,Delhi,Excellent,1.0,False,5.0
16,U1232,18,₹50000,NaN,2022-01-15,Hyderabad,Excellent,1.0,True,5.0
17,U1236,unknown,NaN,it,2022-01-15,Hyderabad,Excellent,5.0,True,5.0
18,U1253,NaN,NaN,it,2020/12/01,Bangalore,Excellent,3.0,True,5.0
19,user_254,60,NaN,HR,2020/12/01,Hyderabad,Excellent,10.0,True,5.0
20,user_272,60,NaN,Finance,2020/12/01,mumbai,Excellent,1.0,True,5.0
21,U1303,-5,NaN,Finance,15/02/2021,mumbai,Poor,0.0,False,1.0
22,user_335,-5,120000.75,HR,2020/12/01,Mumbai,Excellent,5.0,False,5.0
23,U1364,200,₹50000,Finance,15/02/2021,NaN,Poor,10.0,True,1.0
24,user_385,45,NaN,Sales,NaN,NaN,Poor,5.0,True,1.0
25,U1396,-5,120000.75,HR,NaN,NaN,Poor,0.0,True,1.0
26,U1406,30,120000.75,HR,2020/12/01,Hyderabad,Excellent,10.0,False,5.0
27,user_422,18,NaN,it,15/02/2021,NaN,Excellent,10.0,True,5.0
28,user_479,30,45000,HR,invalid,Bangalore,Poor,0.0,False,1.0
29,U1481,25,120000.75,NaN,2022-01-15,Delhi,Excellent,3.0,False,5.0
30,user_501,unknown,25000,it,2022-01-15,Delhi,Poor,1.0,True,1.0
31,user_513,60,120000.75,it,2022-01-15,Hyderabad,Poor,5.0,True,1.0
32,U1519,60,25000,HR,NaN,NaN,Excellent,10.0,True,5.0
33,U1536,-5,45000,IT,2020/12/01,Mumbai,Excellent,3.0,True,5.0
34,U1542,-5,25000,HR,invalid,mumbai,Poor,5.0,True,1.0
35,user_571,NaN,78000,it,2022-01-15,Bangalore,Poor,3.0,True,1.0
36,U1578,60,25000,HR,invalid,DELHI,Excellent,1.0,True,5.0
37,user_597,-5,45000,NaN,NaN,NaN,Poor,1.0,True,1.0
38,U1617,unknown,78000,it,2022-01-15,Bangalore,Poor,5.0,False,1.0
39,U1641,unknown,25000,IT,2022-01-15,DELHI,Excellent,10.0,False,5.0
40,user_646,18,78000,IT,2020/12/01,Hyderabad,Poor,0.0,False,1.0
41,U1650,NaN,45000,HR,2022-01-15,NaN,Poor,1.0,False,1.0
42,U1666,45,NaN,Sales,invalid,Delhi,Poor,3.0,True,1.0
43,U1684,NaN,120000.75,IT,2020/12/01,Mumbai,Excellent,5.0,True,5.0
44,U1756,25,120000.75,HR,invalid,mumbai,Excellent,3.0,True,5.0
45,user_762,NaN,NaN,HR,15/02/2021,Hyderabad,Poor,3.0,False,1.0
46,U1776,30,25000,Sales,15/02/2021,NaN,Poor,10.0,True,1.0
47,U1790,NaN,NaN,HR,invalid,mumbai,Excellent,1.0,False,5.0
48,U1797,-5,₹50000,HR,invalid,mumbai,Excellent,0.0,False,5.0
49,U1816,200,120000.75,HR,NaN,Delhi,Excellent,5.0,True,5.0
50,user_823,-5,45000,Finance,invalid,Hyderabad,Excellent,0.0,True,5.0
51,U1843,45,78000,HR,15/02/2021,Bangalore,Excellent,1.0,False,5.0
52,U1867,60,78000,IT,2020/12/01,DELHI,Poor,3.0,True,1.0
53,U1900,30,45000,Sales,2022-01-15,mumbai,Poor,1.0,False,1.0
54,user_901,30,78000,it,invalid,NaN,Excellent,1.0,False,5.0
55,U1938,200,120000.75,Finance,2020/12/01,mumbai,Excellent,1.0,True,5.0
56,U1957,18,25000,HR,NaN,Bangalore,Excellent,0.0,True,5.0
57,user_969,-5,NaN,Sales,NaN,DELHI,Poor,1.0,True,1.0
58,user_976,18,120000.75,Finance,invalid,mumbai,Poor,3.0,True,1.0
59,user_989,NaN,120000.75,HR,NaN,Bangalore,Poor,10.0,False,1.0